In [145]:
import pandas as py

# Column Removal

1. Use the pandas read_csv function to read in BL-Flicker-Images-Book.csv as a dataframe with the variable name "books". 
2. Identify the command to view the first 5 lines of the data frame. 
3. When looking at the data, we have realized that there are a few columns that are not needed for our data analysis. Use the dataframe drop function to remove columns with the identifiers below:

'Edition Statement'
'Corporate Author'
'Corporate Contributors'
'Former owner'
'Engraver'
'Contributors'
'Issuance type'
'Shelfmarks'

4. Take a look at the first 5 lines again to ensure that the coluumns are removed.

In [132]:
books = py.read_csv('BL-Flickr-Images-Book.csv')  # Read data as dataframe

In [133]:
books.head()  # View first five rows of the dataframe

,Identifier,Edition Statement,Place of Publication,Date of Publication,Publisher,Title,Author,Contributors,Corporate Author,Corporate Contributors,Former owner,Engraver,Issuance type,Flickr URL,Shelfmarks
0,206,NaN,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,"FORBES, Walter.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12641.b.30.
1,216,NaN,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12626.cc.2.
2,218,NaN,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12625.dd.1.
3,472,NaN,London,1851,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.","Appleyard, Ernest Silvanus.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 10369.bbb.15.
4,480,"A new edition, revised, etc.",London,1857,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.","BROOME, John Henry.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 9007.d.28.

In [134]:
books = books.drop(
    columns=['Edition Statement', 'Corporate Author', 'Corporate Contributors', 'Former owner', 'Engraver',
             'Contributors', 'Issuance type', 'Shelfmarks'])  # Delete columns in a dataframe

## Changing the Index of a Dataframe

A Pandas Index extends the functionality of NumPy arrays to allow for more versatile slicing and labeling. In many cases, it is helpful to use a uniquely valued identifying field of the data as its index.

1. In the "Identifier" column, one would expect each entry to be unique. Find the function for dataframes that will let you know if all entries in the column are unique or not. 

2. Replace the existing index with the indices of the "identifier" column using the set_index function. Then view the first 5 lines, what is different?

    3. We can access each recorod using the dataframe loc function for label based indexing. Please use the loc function to find record 209.

In [135]:
# books['Identifier'].unique()
uniqueness = books['Identifier'].value_counts()  # Returns a series of numbers
max(uniqueness)  # If the max number in the series is 1, then the column contains unique values

1

In [136]:
books.set_index('Identifier')

,Place of Publication,Date of Publication,Publisher,Title,Author,Flickr URL
Identifier,,,,,,
206,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,http://www.flickr.com/photos/britishlibrary/ta...
216,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
218,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
472,London,1851,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...
480,London,1857,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...
...,...,...,...,...,...,...
4158088,London,1838,NaN,"The Parochial History of Cornwall, founded on,...","GIDDY, afterwards GILBERT, Davies.",http://www.flickr.com/photos/britishlibrary/ta...
4158128,Derby,"1831, 32",M. Mozley & Son,The History and Gazetteer of the County of Der...,"GLOVER, Stephen - of Derby",http://www.flickr.com/photos/britishlibrary/ta...
4159563,London,[1806]-22,T. Cadell and W. Davies,Magna Britannia; being a concise topographical...,"LYSONS, Daniel - M.A., F.R.S., and LYSONS (Sam...",http://www.flickr.com/photos/britishlibrary/ta...
4159587,Newcastle upon Tyne,1834,Mackenzie & Dent,"An historical, topographical and descriptive v...","Mackenzie, E. (Eneas)",http://www.flickr.com/photos/britishlibrary/ta...
4160339,London,1834-43,NaN,Collectanea Topographica et Genealogica. [Firs...,NaN,http://www.flickr.com/photos/britishlibrary/ta...

In [137]:
books.head()

,Identifier,Place of Publication,Date of Publication,Publisher,Title,Author,Flickr URL
0,206,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,http://www.flickr.com/photos/britishlibrary/ta...
1,216,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
2,218,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
3,472,London,1851,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...
4,480,London,1857,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...

When index of the dataframe is replaced with the indices of the *Identifier* column, the default index column is dropped.

In [138]:
books.loc[209]

Identifier                                                          78740
Place of Publication                                            Inverness
Date of Publication                                                [1890]
Publisher                                            “Northern Chronicle”
Title                   Handbook to the Highland Railway ... Season 18...
Author                                    Anderson, George - of Inverness
Flickr URL              http://www.flickr.com/photos/britishlibrary/ta...
Name: 209, dtype: object

In this section, we will clean specific columns and get them to a uniform format to get a better understanding of the dataset and enforce consistency. In particular, we will be cleaning Date of Publication and Place of Publication.

1. Identify the type of data in each column. 
2. Determine what woud need to bedonet clean the 'Data of Publication' column. Use the regex function for dataframes to remove necessary characters then convert to numerical formats.

1. Identify the type of data in each column. 
2. Determine what woud need to bedonet clean the 'Data of Publication' column. Use the regex function for dataframes to remove necessary characters then convert to numerical formats.

In [139]:
books.dtypes

Identifier               int64
Place of Publication    object
Date of Publication     object
Publisher               object
Title                   object
Author                  object
Flickr URL              object
dtype: object

In [153]:
books['Date of Publication'] = books['Date of Publication'].replace(r'', '0')

In [154]:
books['Date of Publication'] = books['Date of Publication'].str.extract('(^\d*)')

In [155]:
books['Date of Publication'] = books['Date of Publication'].fillna(0)

In [156]:
books = books.astype({'Date of Publication': 'int'})
books

,Identifier,Place of Publication,Date of Publication,Publisher,Title,Author,Flickr URL
0,206,London,1879,S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,http://www.flickr.com/photos/britishlibrary/ta...
1,216,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
2,218,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
3,472,London,1851,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...
4,480,London,1857,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...
...,...,...,...,...,...,...,...
8282,4158088,London,1838,NaN,"The Parochial History of Cornwall, founded on,...","GIDDY, afterwards GILBERT, Davies.",http://www.flickr.com/photos/britishlibrary/ta...
8283,4158128,Derby,1831,M. Mozley & Son,The History and Gazetteer of the County of Der...,"GLOVER, Stephen - of Derby",http://www.flickr.com/photos/britishlibrary/ta...
8284,4159563,London,0,T. Cadell and W. Davies,Magna Britannia; being a concise topographical...,"LYSONS, Daniel - M.A., F.R.S., and LYSONS (Sam...",http://www.flickr.com/photos/britishlibrary/ta...
8285,4159587,Newcastle upon Tyne,1834,Mackenzie & Dent,"An historical, topographical and descriptive v...","Mackenzie, E. (Eneas)",http://www.flickr.com/photos/britishlibrary/ta...
8286,4160339,London,1834,NaN,Collectanea Topographica et Genealogica. [Firs...,NaN,http://www.flickr.com/photos/britishlibrary/ta...

There are some instances where it would be helpful to apply a customized function to each cell or element of a DataFrame. Pandas .applymap() method is similar to the in-built map() function and simply applies a function to all the elements in a DataFrame.

1. Use the head function to take a look at university_towns.txt. 
2. Create a with statement with an embeadded for lop and if/else statement such that when you run university_towns[:5] you get:


[('Alabama[edit]\n', 'Auburn (Auburn University)[1]\n'),
 ('Alabama[edit]\n', 'Florence (University of North Alabama)\n'),
 ('Alabama[edit]\n', 'Jacksonville (Jacksonville State University)[2]\n'),
 ('Alabama[edit]\n', 'Livingston (University of West Alabama)[2]\n'),
 ('Alabama[edit]\n', 'Montevallo (University of Montevallo)[2]\n')]
 
 3. Convert to a dataframe for which the column names are "State" and "RegionName". Name the new dataframe uni_df.
 
 4. Run the block of code below. Exaplain what it does.

1. Use the head function to take a look at university_towns.txt. 
2. Create a with statement with an embeadded for lop and if/else statement such that when you run university_towns[:5] you get:


[('Alabama[edit]\n', 'Auburn (Auburn University)[1]\n'),
 ('Alabama[edit]\n', 'Florence (University of North Alabama)\n'),
 ('Alabama[edit]\n', 'Jacksonville (Jacksonville State University)[2]\n'),
 ('Alabama[edit]\n', 'Livingston (University of West Alabama)[2]\n'),
 ('Alabama[edit]\n', 'Montevallo (University of Montevallo)[2]\n')]
 
 3. Convert to a dataframe for which the column names are "State" and "RegionName". Name the new dataframe uni_df.
 
 4. Run the block of code below. Exaplain what it does.

In [245]:
university_towns = py.read_csv('university_towns.txt', sep="\\t", engine='python')
university_towns.head()

                                     Alabama[edit]
0                    Auburn (Auburn University)[1]
1           Florence (University of North Alabama)
2  Jacksonville (Jacksonville State University)[2]
3       Livingston (University of West Alabama)[2]
4         Montevallo (University of Montevallo)[2]

In [246]:
# with open('university_towns.txt', 'r') as file:
#     for index, data in enumerate(file):
#         if data != 'Alabama[edit]\n':
#             university_towns = university_towns.applymap(
#                 lambda x: ('Alabama[edit]\n', '{}\n'.format(x)) if str(x).strip() == str(data).strip() else x)
#             # print(str(data).strip())
#             # print('Alabama[edit]\t{}'.format(data), university_towns.loc[index])
#             # university_towns = university_towns.applymap(
#             # lambda x: ('Alabama[edit]\n', '{}'.format(x)) if x == 'Alabama[edit]\t{}'.format(data) else x)
# university_towns[:5]

In [247]:
uni_df = py.melt(university_towns, var_name='State', value_name='RegionName')
uni_df.head()

           State                                       RegionName
0  Alabama[edit]                    Auburn (Auburn University)[1]
1  Alabama[edit]           Florence (University of North Alabama)
2  Alabama[edit]  Jacksonville (Jacksonville State University)[2]
3  Alabama[edit]       Livingston (University of West Alabama)[2]
4  Alabama[edit]         Montevallo (University of Montevallo)[2]

In [248]:
def get_citystate(item):
    if ' (' in item:
        return item[:item.find(' (')]
    elif '[' in item:
        return item[:item.find('[')]
    else:
        return item

The function above tries to clean the region names by removing all text withing a bracket and a square bracket.

1. Apply get_citystate to uni_df using applymap. 
2. View the head of the new uni_df.

In [251]:
uni_df = uni_df.applymap(lambda x: get_citystate(x))

In [252]:
uni_df.head()

     State    RegionName
0  Alabama        Auburn
1  Alabama      Florence
2  Alabama  Jacksonville
3  Alabama    Livingston
4  Alabama    Montevallo

Often, the datasets you’ll work with will have either column names that are not easy to understand, or unimportant information in the first few and/or last rows, such as definitions of the terms in the dataset, or footnotes.

1. Read in olympics.csv using pandas. 
2. View the first 5 lines of the data. 
3. Go to https://en.wikipedia.org/wiki/All-time_Olympic_Games_medal_table to view the source of the data. What should the data look like?
4. Run the block of code below to create the new name dictionary.

1. Read in olympics.csv using pandas. 
2. View the first 5 lines of the data. 
3. Go to https://en.wikipedia.org/wiki/All-time_Olympic_Games_medal_table to view the source of the data. What should the data look like?
4. Run the block of code below to create the new name dictionary.

In [281]:
olympics = py.read_csv('olympics.csv')
olympics.head()

,Unnamed: 0,? Summer,01 !,02 !,03 !,Total,? Winter,01 !.1,02 !.1,03 !.1,Total.1,? Games,01 !.2,02 !.2,03 !.2,Combined total
0,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
1,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
2,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
3,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
4,Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [282]:
new_names = {'Unnamed: 0': 'Country', '? Summer': 'Summer Olympics', '01 !': 'Gold','02 !': 'Silver','03 !': 'Bronze','? Winter': 'Winter Olympics','01 !.1': 'Gold.1','02 !.1': 'Silver.1','03 !.1': 'Bronze.1','? Games': '# Games','01 !.2': 'Gold.2','02 !.2': 'Silver.2','03 !.2': 'Bronze.2'}

SyntaxError: invalid syntax (915103841.py, line 1)

In [284]:
olympics.rename(columns=new_names, inplace=True)

,Country,Summer Olympics,Gold,Silver,Bronze,Total,Winter Olympics,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
0,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
1,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
2,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
3,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
4,Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12